app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kamala"], ["email", "[FILTERED]"], ["city", "Delware"], ["created_at", "2024-08-25 21:24:11.678680"], ["updated_at", "2024-08-25 21:24:11.678680"]]
---
    def create
      @user = User.new(user_params)
      if @user.save